yugobalkan-droid/saglikbileklik/hardware/esp32/esp32_medicine_box/esp32_medicine_box.ino
/*
 * =========================================================
 *  CareSync – ESP32-S3 İlaç Kutusu (Ana Cihaz)
 *  Kart: ESP32-S3 2022 v1.3
 *
 *  Donanım Bağlantıları:
 *    NeoPixel LED → GPIO 4  (21 adet WS2812B - 7 gün x 3 öğün)
 *    Hoparlör     → GPIO 46  (2N2222A transistör ile)
 *    Button      → GPIO 36
 *    ESP-NOW     → Dahili (ESP32-S3 WiFi radyo)
 * =========================================================
 */

#include <ArduinoJson.h>
#include <Firebase_ESP_Client.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <addons/RTDBHelper.h>
#include <addons/TokenHelper.h>
#include <time.h>
#include <Adafruit_NeoPixel.h>

/* ─── ESP32-S3 Uyumluluğu ──────────────────────────────── */
// NRF24 kaldırıldı – ESP-NOW kullanılıyor

/* ─── WiFi Ayarları ─────────────────────────────────────── */
#define WIFI_SSID "Harun59"
#define WIFI_PASSWORD "Harun5959"

/* ─── Firebase Ayarları ─────────────────────────────────── */
#define API_KEY "AIzaSyDHII3X9MFkX5_HF6W5NtyosNyHFef9uDs"
#define DATABASE_URL "https://saglikbileklik-356ed-default-rtdb.europe-west1.firebasedatabase.app"
#define PROJECT_ID "saglikbileklik-356ed"
#define USER_EMAIL "test@test.com"
#define USER_PASSWORD "test123"

/* ─── Pin Tanımlamaları ────────────────────────────── */
#define NEOPIXEL_PIN 4     // 21 Adreslenebilir LED (WS2812B)
#define BUZZER_PIN 46      // Hoparlör (Transistör ile)
#define BUTTON_PIN 36      // Buton (ilaç alındı onayı)

/* ─── NeoPixel LED Ayarları ───────────────────── */
#define NUM_LEDS 21
#define LED_BRIGHTNESS 50  // 0-255 arası (%20 parlaklık = güç tasarrufu)
Adafruit_NeoPixel strip(NUM_LEDS, NEOPIXEL_PIN, NEO_GRB + NEO_KHZ800);

// LED Renkleri (Öğün Bazlı)
// Sabah (LED 0-6):  Yeşil tonları
// Öğle (LED 7-13):  Mavi tonları
// Akşam (LED 14-20): Mor tonları
uint32_t periodColors[3];

// Aktif alarm LED indeksi (-1 = alarm yok)
int alarmLedIndex = -1;

/* ─── ESP-NOW Mesaj Yapısı ────────────────────────────── */
// Bileklik ile aynı yapı (her iki tarafta eş olmalı!)
typedef struct espnow_message_t {
  char deviceId[20];   // Gönderen cihaz kimliği
  char command[10];    // Komut: "ILAC", "ONAY", "PING", "PONG"
  uint32_t timestamp;  // millis() zaman damgası
} espnow_message_t;

// Broadcast MAC adresi
uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
bool espnowReady = false;

/* ─── Durum Bayrakları ───────────────────────────────────── */
String deviceId = "esp32_medicine_box_01";
bool alarmActive = false;
bool buttonPressed = false;
String lastTriggeredAlarmTime = "";

// Sürekli alarm (non-blocking) için değişkenler
unsigned long lastBeepTime = 0;
unsigned long alarmStartTime = 0;
unsigned long lastESPNowSend = 0;  // ESP-NOW sinyal gönderim zamanlayıcı
bool beepState = false;

// Ses ayarları
int melodyType = 0; // 0: Standart, 1: Siren, 2: Hızlı, 3: Özel
int customFreq = 1000;
int customSpeed = 500;
int volume = 100;
bool testSoundActive = false;
unsigned long testSoundStartTime = 0;

// WiFi & Firebase bağlantı kurtarma
unsigned long lastWiFiCheck = 0;
const unsigned long WIFI_CHECK_INTERVAL = 30000; // 30 sn
unsigned long lastTokenCheck = 0;
const unsigned long TOKEN_CHECK_INTERVAL = 60000; // 1 dk
int firebaseFailCount = 0;
const int MAX_FIREBASE_FAILS = 3; // 3 ardışık hata sonrası token sıfırla

/* ─── Fonksiyon Bildirimleri ─────────────────────────────── */
void stopAlarm();
void confirmMedicineTaken();

/* ─── ESP-NOW Callback'leri ────────────────────────────── */
// Bileklikten mesaj geldiğinde
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void onESPNowDataRecv(const esp_now_recv_info_t *info, const uint8_t *data, int dataLen) {
#else
void onESPNowDataRecv(const uint8_t *mac, const uint8_t *data, int dataLen) {
#endif
  if (dataLen != sizeof(espnow_message_t)) return;
  
  espnow_message_t msg;
  memcpy(&msg, data, sizeof(msg));
  
  Serial.printf("[ESP-NOW] 📨 Mesaj alındı: cmd=%s, from=%s\n", msg.command, msg.deviceId);
  
  if (strcmp(msg.command, "ONAY") == 0) {
    Serial.println("[ESP-NOW] ✅ Bileklikten ilaç onayı alındı!");
    if (alarmActive) {
      stopAlarm();
      confirmMedicineTaken();
      // Ek DUR sinyali gönder (güvenilirlik için 2 kez)
      sendESPNowStopSignal();
      delay(50);
      sendESPNowStopSignal();
    }
  }
}

// Mesaj gönderim durumu
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void onESPNowDataSent(const wifi_tx_info_t *info, esp_now_send_status_t status) {
#else
void onESPNowDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
#endif
  Serial.printf("[ESP-NOW] Gönderim: %s\n", 
                status == ESP_NOW_SEND_SUCCESS ? "✅ Başarılı" : "❌ Başarısız");
}

/* ─── Firebase Nesneleri ─────────────────────────────────── */
FirebaseData fbdo;
FirebaseAuth auth;
FirebaseConfig config;

/* ─── Zamanlama ──────────────────────────────────────────── */
unsigned long lastFirebaseCheck = 0;
const unsigned long FIREBASE_INTERVAL = 15000; // 15 saniyede bir kontrol


/* ─────────────────────────────────────────────────────────
   SETUP
   ───────────────────────────────────────────────────────── */
void setup() {
  Serial.begin(115200);
  delay(200);

  // Pin modları
  pinMode(NEOPIXEL_PIN, OUTPUT);
  strip.begin();
  strip.setBrightness(LED_BRIGHTNESS);
  strip.clear();
  strip.show();
  
  // Öğün renklerini ayarla
  periodColors[0] = strip.Color(0, 255, 50);   // Sabah = Yeşil
  periodColors[1] = strip.Color(0, 100, 255);   // Öğle = Mavi
  periodColors[2] = strip.Color(180, 0, 255);   // Akşam = Mor
  
  pinMode(BUZZER_PIN, OUTPUT);
  pinMode(BUTTON_PIN, INPUT_PULLUP); // Harici Buton
  pinMode(0, INPUT_PULLUP);          // Dahili BOOT Butonu

  digitalWrite(BUZZER_PIN, LOW);

  Serial.println("\n=== CareSync ESP32 Başlıyor ===");

  // ── WiFi Bağlan ──
  WiFi.mode(WIFI_AP_STA);  // AP+STA modu: ESP-NOW + WiFi birlikte çalışsın
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  Serial.print("WiFi bağlanıyor");
  int retries = 0;
  while (WiFi.status() != WL_CONNECTED && retries < 30) {
    Serial.print(".");
    delay(500);
    retries++;
  }
    if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\n[WIFI] ✅ WiFi bağlandı!");
    Serial.println("[WIFI] IP Adresi: " + WiFi.localIP().toString());
    
    // Bilekliğin kanalı bulabilmesi için aynı kanalda görünür bir AP başlat
    WiFi.softAP("CareSync_Box", "12345678", WiFi.channel(), 0); // 0 = görünür AP
    
    Serial.printf("\n======================================================\n");
    Serial.printf("👉 BİLEKLİK İÇİN GEREKLİ KANAL (ESPNOW_CHANNEL): %d\n", WiFi.channel());
    Serial.printf("======================================================\n\n");
  } else {
    Serial.println("\n[WIFI] ❌ WiFi bağlanamadı, çevrimdışı modda devam ediliyor.");
    WiFi.softAP("CareSync_Box", "12345678", 4, 0); // Varsayılan kanal 4, görünür
  }


