yugobalkan-droid/saglikbileklik/hardware/esp32/esp32_medicine_box/esp32_medicine_box.ino
  // ── ESP-NOW Başlat (WiFi'dan sonra!) ──
  if (esp_now_init() == ESP_OK) {
    esp_now_register_recv_cb(onESPNowDataRecv);
    esp_now_register_send_cb(onESPNowDataSent);
    
    // Broadcast peer ekle
    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, broadcastAddress, 6);
    peerInfo.channel = 0;  // WiFi kanalı ile aynı (otomatik)
    peerInfo.encrypt = false;
    esp_now_add_peer(&peerInfo);
    
    espnowReady = true;
    Serial.println("[ESP-NOW] ✅ ESP-NOW hazır!");
    
    // MAC adresini yazdır
    uint8_t mac[6];
    WiFi.macAddress(mac);
    Serial.printf("[ESP-NOW] 📟 Bu cihazın MAC: %02X:%02X:%02X:%02X:%02X:%02X\n",
                  mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  } else {
    Serial.println("[ESP-NOW] ❌ Başlatılamadı!");
  }

  // ── NTP (Saat) Senkronizasyonu ──
  // Türkiye saati: UTC+3 (3 * 3600 = 10800 saniye ofset)
  configTime(10800, 0, "pool.ntp.org", "time.nist.gov");
  Serial.print("[NTP] Saat bekleniyor");
  time_t now = time(nullptr);
  int ntpRetries = 0;
  while (now < 24 * 3600 && ntpRetries < 20) {
    Serial.print(".");
    delay(500);
    now = time(nullptr);
    ntpRetries++;
  }
  if (now > 24 * 3600) {
    struct tm timeinfo;
    getLocalTime(&timeinfo);
    Serial.printf("\n[NTP] Saat güncellendi: %02d:%02d\n", timeinfo.tm_hour,
                  timeinfo.tm_min);
  } else {
    Serial.println("\n[NTP] Saat alınamadı! (Geçici çevrimdışı saat)");
  }

  // ── Firebase Başlat ──
  config.api_key = API_KEY;
  config.database_url = DATABASE_URL;  // Token yenileme için gerekli!
  auth.user.email = USER_EMAIL;
  auth.user.password = USER_PASSWORD;
  config.token_status_callback = tokenStatusCallback;
  config.timeout.networkReconnect = 10000;   // 10 sn ağ yeniden bağlanma
  config.timeout.serverResponse = 10000;     // 10 sn sunucu cevap süresi
  config.timeout.socketConnection = 10000;   // 10 sn soket bağlantı

  Firebase.begin(&config, &auth);
  Firebase.reconnectNetwork(true);
  Firebase.reconnectWiFi(true);

  // Başlangıç LED & Buzzer testi
  startupSequence();

  // Firebase cihaz durumunu güncelle
  updateDeviceStatus("online");

  Serial.println("=== Sistem Hazır ===");
}

/* ─────────────────────────────────────────────────────────
   LOOP
   ───────────────────────────────────────────────────────── */
void loop() {
  // ── WiFi Bağlantı Kontrolü & Otomatik Yeniden Bağlanma ──
  if (millis() - lastWiFiCheck > WIFI_CHECK_INTERVAL) {
    lastWiFiCheck = millis();
    if (WiFi.status() != WL_CONNECTED) {
      Serial.println("[WIFI] ❌ Bağlantı koptu! Yeniden bağlanılıyor...");
      WiFi.disconnect();
      delay(500);
      WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
      int retries = 0;
      while (WiFi.status() != WL_CONNECTED && retries < 20) {
        delay(500);
        Serial.print(".");
        retries++;
      }
      if (WiFi.status() == WL_CONNECTED) {
        Serial.println("\n[WIFI] ✅ Yeniden bağlandı! IP: " + WiFi.localIP().toString());
        WiFi.softAP("CareSync_Box", "12345678", WiFi.channel(), 0);
        configTime(10800, 0, "pool.ntp.org", "time.nist.gov");
        firebaseFailCount = 0;
      } else {
        Serial.println("\n[WIFI] ❌ Hala bağlanamadı, sonraki döngüde tekrar deneyecek.");
      }
    }
  }

  // ── Firebase Token Kurtarma Mekanizması ──
  if (millis() - lastTokenCheck > TOKEN_CHECK_INTERVAL) {
    lastTokenCheck = millis();
    if (!Firebase.ready()) {
      firebaseFailCount++;
      Serial.printf("[FIREBASE] ⚠️ Token hazır değil! Ardışık hata: %d/%d\n", firebaseFailCount, MAX_FIREBASE_FAILS);
      if (firebaseFailCount >= MAX_FIREBASE_FAILS) {
        Serial.println("[FIREBASE] 🔄 Token sıfırlanıyor (connection lost kurtarma)...");
        Firebase.reset(&config);
        delay(1000);
        Firebase.begin(&config, &auth);
        Firebase.reconnectNetwork(true);
        Firebase.reconnectWiFi(true);
        firebaseFailCount = 0;
        Serial.println("[FIREBASE] ✅ Firebase yeniden başlatıldı!");
      }
    } else {
      if (firebaseFailCount > 0) {
        Serial.println("[FIREBASE] ✅ Token tekrar aktif.");
        firebaseFailCount = 0;
      }
    }
  }

  // ── NTP Yedek Kontrolü ve Bilgi Yazdırma ──
  static unsigned long lastTimePrint = 0;
  if (millis() - lastTimePrint > 60000) {
    lastTimePrint = millis();
    time_t now = time(nullptr);
    if (now < 24 * 3600) {
      Serial.println("[NTP] Saat geçersiz, tekrar senkronize ediliyor...");
      configTime(10800, 0, "pool.ntp.org", "time.nist.gov");
    } else {
      Serial.println("[ZAMAN] ESP32 Güncel Saat: " + getCurrentTimeStr() +
                     " (Gün: " + getCurrentDayStr() + ")");
      Serial.println("[WIFI] İlaç Kutusu WiFi Kanalı: " + String(WiFi.channel()) + " (Bilekliğin config.h dosyasında ESPNOW_CHANNEL ayarını bu sayı yapın)");
    }
  }

  // ── Alarm Aktifse Sürekli Ötme (Non-blocking) ──
  if (alarmActive || testSoundActive) {
    unsigned long currentMillis = millis();

    // Test sesi ise 3 saniye sonra kapat
    if (testSoundActive && (currentMillis - testSoundStartTime >= 3000)) {
      testSoundActive = false;
      noTone(BUZZER_PIN);
      strip.clear();
      strip.show();
      Serial.println("[TEST] Ses testi bitti.");
    } 
    // Gerçek alarm ise 10 dakika (600,000 ms) zaman aşımı kontrolü
    else if (alarmActive && (currentMillis - alarmStartTime >= 600000)) {
      Serial.println("[ALARM] 10 dakika geçti, butona basılmadı. İlaç kaçırıldı!");
      stopAlarm();
      sendMissedAlertToApp();
    } 
    else {
      // Melodi Çalma Motoru
      int speedMs = 500;
      int freq1 = 1000;
      int freq2 = 0;
      
      if (melodyType == 0) { speedMs = 1000; freq1 = 1000; freq2 = 0; }
      else if (melodyType == 1) { speedMs = 300; freq1 = 800; freq2 = 1200; }
      else if (melodyType == 2) { speedMs = 150; freq1 = 2000; freq2 = 0; }
      else if (melodyType == 3) { speedMs = customSpeed; freq1 = customFreq; freq2 = 0; }

      if (currentMillis - lastBeepTime >= speedMs) {
        lastBeepTime = currentMillis;
        beepState = !beepState;
        
        // NeoPixel LED Animasyonu
        if (alarmActive && alarmLedIndex >= 0 && alarmLedIndex < NUM_LEDS) {
          // Alarm LED'i kırmızı-beyaz yanıp söner
          if (beepState) {
            strip.setPixelColor(alarmLedIndex, strip.Color(255, 0, 0)); // Kırmızı
          } else {
            strip.setPixelColor(alarmLedIndex, strip.Color(255, 255, 255)); // Beyaz
          }
          strip.show();
        } else if (testSoundActive) {
          // Test modunda gökkuşağı efekti
          for (int i = 0; i < NUM_LEDS; i++) {
            int hue = (i * 65536 / NUM_LEDS + currentMillis * 10) % 65536;
            strip.setPixelColor(i, strip.gamma32(strip.ColorHSV(hue)));
          }
          strip.show();
        }
        
      int duration = (speedMs * volume) / 100;
        
