yugobalkan-droid/saglikbileklik/hardware/esp32/esp32_medicine_box/esp32_medicine_box.ino
        if (beepState) {
          tone(BUZZER_PIN, freq1, duration);
        } else {
          if (freq2 > 0) {
            tone(BUZZER_PIN, freq2, duration);
          } else {
            noTone(BUZZER_PIN);
          }
        }
        
        // ESP-NOW: Bilekliğe periyodik sinyal (her 10 saniyede bir)
        // Her beep'te göndermek bilekliği tekrar tetikleyebilir!
        if (alarmActive && (currentMillis - lastESPNowSend >= 10000)) {
          lastESPNowSend = currentMillis;
          sendESPNowSignal();
          Serial.println("[ESP-NOW] 📡 Periyodik alarm sinyali gönderildi (10sn).");
        }
      }
    }
  }

  // ── Buton Kontrolü (Harici buton veya Dahili BOOT butonu) ──
  bool isPressed = (digitalRead(BUTTON_PIN) == LOW) ||
                   (digitalRead(0) == LOW); // 0 = BOOT Butonu

  if (isPressed) {
    delay(50); // Debounce
    // Tekrar kontrol et
    if ((digitalRead(BUTTON_PIN) == LOW) || (digitalRead(0) == LOW)) {
      if (!buttonPressed) {
        buttonPressed = true;
        Serial.println("[BUTON] İlaç alındı onayı!");

        if (alarmActive) {
          stopAlarm();
          confirmMedicineTaken();
        }
      }
    }
  } else {
    buttonPressed = false;
  }

  // ── Firebase Periyodik Kontrol ──
  if (WiFi.status() == WL_CONNECTED && Firebase.ready() && 
      (millis() - lastFirebaseCheck > FIREBASE_INTERVAL || lastFirebaseCheck == 0)) {
    lastFirebaseCheck = millis();
    checkFirebaseAlarm();
  }
}

/* ─────────────────────────────────────────────────────────
   FONKSİYONLAR
   ───────────────────────────────────────────────────────── */

// Güncel saati "HH:MM" formatında döndürür
String getCurrentTimeStr() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo)) {
    return "";
  }
  char timeStringBuff[10];
  strftime(timeStringBuff, sizeof(timeStringBuff), "%H:%M", &timeinfo);
  return String(timeStringBuff);
}

// Güncel günü React Native formatında döndürür (0=Pzt, 6=Paz)
String getCurrentDayStr() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo)) {
    return "";
  }
  // C++ tm_wday: 0=Pazar, 1=Pazartesi... 6=Cumartesi
  // React Native format: 0=Pazartesi... 6=Pazar
  int rnDay = (timeinfo.tm_wday == 0) ? 6 : (timeinfo.tm_wday - 1);
  return String(rnDay);
}

// Firebase'den alarm gelip gelmediğini kontrol et
void checkFirebaseAlarm() {
  String documentPath = "devices/" + deviceId;

  if (Firebase.Firestore.getDocument(&fbdo, PROJECT_ID, "",
                                     documentPath.c_str(), "")) {
    Serial.println("[Firebase] Belge alındı. JSON ayrıştırılıyor...");

    // Gelen JSON verisini parse et
    DynamicJsonDocument doc(4096);
    DeserializationError error = deserializeJson(doc, fbdo.payload());

    if (error) {
      Serial.print("[JSON Hata] Ayrıştırma başarısız: ");
      Serial.println(error.c_str());
      return;
    }

    // YÖNTEM B: 'triggerAlert' kontrolü (Mobil uygulama anlık tetikler)
    bool triggerAlert = doc["fields"]["triggerAlert"]["booleanValue"] | false;

    // UZAKTAN DURDURMA KONTROLÜ
    bool stopAlert = doc["fields"]["stopAlert"]["booleanValue"] | false;

    // YÖNTEM C: Ses Testi Kontrolü
    bool testSound = doc["fields"]["testSound"]["booleanValue"] | false;

    // SES AYARLARINI OKU
    if (doc["fields"].containsKey("settings")) {
      JsonObject settingsMap = doc["fields"]["settings"]["mapValue"]["fields"];
      if (settingsMap.containsKey("melodyType")) {
        melodyType = atoi(settingsMap["melodyType"]["integerValue"].as<const char*>());
      }
      if (settingsMap.containsKey("customFreq")) {
        int f = atoi(settingsMap["customFreq"]["integerValue"].as<const char*>());
        if (f > 0) customFreq = f;
      }
      if (settingsMap.containsKey("customSpeed")) {
        int s = atoi(settingsMap["customSpeed"]["integerValue"].as<const char*>());
        if (s > 0) customSpeed = s;
      }
      if (settingsMap.containsKey("volume")) {
        int v = atoi(settingsMap["volume"]["integerValue"].as<const char*>());
        if (v > 0) volume = v;
      }
    }

    if (testSound && !testSoundActive) {
      Serial.println("[TEST] Firebase'den 'testSound=true' komutu geldi!");
      testSoundActive = true;
      testSoundStartTime = millis();
      lastBeepTime = millis();
      beepState = true;
      
      int startFreq = 1000;
      if (melodyType == 1) startFreq = 800;
      else if (melodyType == 2) startFreq = 2000;
      else if (melodyType == 3) startFreq = customFreq;
      
      int duration = 1000;
      if (melodyType == 1) duration = 300;
      else if (melodyType == 2) duration = 150;
      else if (melodyType == 3) duration = customSpeed;
      
      tone(BUZZER_PIN, startFreq, (duration * volume) / 100);
      
      FirebaseJson content;
      content.set("fields/testSound/booleanValue", false);
      String documentPath = "devices/" + deviceId;
      Firebase.Firestore.patchDocument(&fbdo, PROJECT_ID, "", documentPath.c_str(), content.raw(), "testSound");
    }

    // YÖNTEM A: 'scheduleJSON' kontrolü (Bağımsız Cihaz)
    String scheduleJSONStr = doc["fields"]["scheduleJSON"]["stringValue"] | "";
    String currentTime = getCurrentTimeStr();
    String currentDay = getCurrentDayStr();

    if (stopAlert) {
      Serial.println(
          "[ALARM] Firebase'den 'stopAlert=true' (Durdur) komutu geldi!");
      if (alarmActive) {
        stopAlarm();
      }
      clearStopAlert(); // İşlem bittikten sonra Firebase'de false yap
    }

    if (triggerAlert) {
      Serial.println("[ALARM] Firebase'den 'triggerAlert=true' komutu geldi!");
      if (!alarmActive) {
        triggerAlarm();
        // Alarmın sonsuz döngüde çalmasını engellemek için Firebase'de false'a
        // çekilebilir
        clearTriggerAlert();
      }
    } else if (scheduleJSONStr != "" && currentTime != "" && currentDay != "") {
      Serial.println("\n[DEBUG] ---------------------------------------");
      Serial.printf("[DEBUG] WiFi Kanalı (ESP-NOW Kanalı): %d\n", WiFi.channel());
      Serial.println("[DEBUG] Firebase'den Gelen Ham JSON:");
      Serial.println(scheduleJSONStr);
      Serial.println("[DEBUG] ---------------------------------------");

      // Haftalık programı parse et
      DynamicJsonDocument schedDoc(4096);
      DeserializationError schedError =
          deserializeJson(schedDoc, scheduleJSONStr);

