yugobalkan-droid/saglikbileklik/hardware/esp32/esp32_medicine_box/esp32_medicine_box.ino
      if (!schedError) {
        JsonObject root = schedDoc.as<JsonObject>();
        // Bugünün saatlerini kontrol et
        JsonArray todayAlarms = root[currentDay.c_str()];
        bool shouldAlarm = false;
        int matchedPeriod = -1;

        Serial.println("[DEBUG] İncelenen Gün: " + currentDay +
                       " | Mevcut Saat: " + currentTime);
        Serial.print("[DEBUG] Bu Gün İçin Ayarlı Saatler: ");

        if (todayAlarms.isNull() || todayAlarms.size() == 0) {
          Serial.println("(Hiç alarm yok)");
        } else {
          for (JsonVariant value : todayAlarms) {
            // Yeni format: {"t":"08:00","p":0}
            // Eski format uyumluluğu: salt string "08:00"
            String alarmTime;
            int period = 0;
            
            if (value.is<JsonObject>()) {
              alarmTime = value["t"].as<String>();
              period = value["p"] | 0;
            } else {
              alarmTime = value.as<String>();
            }
            alarmTime.trim();
            Serial.print(alarmTime + "(p" + String(period) + ") ");
            
            if (alarmTime == currentTime) {
              shouldAlarm = true;
              matchedPeriod = period;
            }
          }
          Serial.println("");
        }

        if (shouldAlarm) {
          if (lastTriggeredAlarmTime != currentTime && !alarmActive) {
            Serial.println("[ALARM] Programlanan saat geldi: " + currentTime);
            lastTriggeredAlarmTime = currentTime;
            
            // LED indeksini hesapla: (period * 7) + day
            int dayInt = currentDay.toInt();
            if (matchedPeriod >= 0 && matchedPeriod <= 2 && dayInt >= 0 && dayInt <= 6) {
              alarmLedIndex = (matchedPeriod * 7) + dayInt;
            } else {
              alarmLedIndex = dayInt; // Fallback: sadece gün
            }
            Serial.printf("[LED] Alarm LED indeksi: %d (Gün:%d, Öğün:%d)\n", alarmLedIndex, dayInt, matchedPeriod);
            triggerAlarm();
          } else if (lastTriggeredAlarmTime == currentTime) {
            Serial.println("[DEBUG] Alarm bu dakika içinde zaten tetiklendi.");
          }
        } else {
          if (lastTriggeredAlarmTime != "") {
            lastTriggeredAlarmTime = "";
          }
        }
      } else {
        Serial.println("[JSON Hata] scheduleJSON parse edilemedi.");
      }
    }
  } else {
    String errMsg = fbdo.errorReason();
    Serial.println("[Firebase] Hata: " + errMsg);
    // Token hatası tespit edilirse sayacı artır
    if (errMsg.indexOf("token") >= 0 || errMsg.indexOf("connection lost") >= 0) {
      firebaseFailCount++;
      Serial.printf("[FIREBASE] ⚠️ Token/bağlantı hatası! Sayaç: %d/%d\n", firebaseFailCount, MAX_FIREBASE_FAILS);
    }
  }
}

// Alarm çaldıktan sonra 'triggerAlert' alanını temizle
void clearTriggerAlert() {
  if (Firebase.ready()) {
    FirebaseJson content;
    content.set("fields/triggerAlert/booleanValue", false);

    String documentPath = "devices/" + deviceId;
    if (Firebase.Firestore.patchDocument(&fbdo, PROJECT_ID, "",
                                         documentPath.c_str(), content.raw(),
                                         "triggerAlert")) {
      Serial.println("[Firebase] triggerAlert false yapıldı.");
    }
  }
}

// Alarm durdurulduktan sonra 'stopAlert' alanını temizle
void clearStopAlert() {
  if (Firebase.ready()) {
    FirebaseJson content;
    content.set("fields/stopAlert/booleanValue", false);

    String documentPath = "devices/" + deviceId;
    if (Firebase.Firestore.patchDocument(&fbdo, PROJECT_ID, "",
                                         documentPath.c_str(), content.raw(),
                                         "stopAlert")) {
      Serial.println("[Firebase] stopAlert false yapıldı.");
    }
  }
}

// Alarm başlat: Sadece bayrakları kurar, asıl ötme işlemi loop() içinde yapılır
void triggerAlarm() {
  alarmActive = true;
  beepState = true;
  lastBeepTime = millis();
  alarmStartTime = millis();
  
  // İlgili LED'i kırmızı yak
  if (alarmLedIndex >= 0 && alarmLedIndex < NUM_LEDS) {
    strip.clear();
    strip.setPixelColor(alarmLedIndex, strip.Color(255, 0, 0));
    strip.show();
  }
  
  Serial.printf("[ALARM] Alarm başlatıldı! LED:%d (Butona basılana kadar ötecek)\n", alarmLedIndex);

  // ESP-NOW ile bilekliğe ilk sinyal gönder
  lastESPNowSend = millis();  // Zamanlayıcıyı başlat
  sendESPNowSignal();
  delay(100);
  sendESPNowSignal();  // Güvenilirlik için 2. sinyal

  // Mobil uygulamaya "Alarm Çaldı" bilgisini gönder
  sendAlertToApp();
}

// Uygulamaya otonom alarmın başladığını haber ver (AlertOverlay çıkması için)
void sendAlertToApp() {
  if (Firebase.ready()) {
    FirebaseJson content;
    // Uygulama bu alanın güncellendiğini görünce lokal bildirim/AlertOverlay
    // çıkartabilir
    content.set("fields/lastAutonomousAlarm/stringValue", getCurrentTimeStr());

    String documentPath = "devices/" + deviceId;
    if (Firebase.Firestore.patchDocument(&fbdo, PROJECT_ID, "",
                                         documentPath.c_str(), content.raw(),
                                         "lastAutonomousAlarm")) {
      Serial.println("[Firebase] Uygulamaya bildirim gönderildi "
                     "(lastAutonomousAlarm güncellendi).");
    }
  }
}

// Uygulamaya ilacın kaçırıldığını (10 dk timeout) haber ver
void sendMissedAlertToApp() {
  if (Firebase.ready()) {
    FirebaseJson content;
    content.set("fields/lastMissedAlarm/stringValue", getCurrentTimeStr());

    String documentPath = "devices/" + deviceId;
    if (Firebase.Firestore.patchDocument(&fbdo, PROJECT_ID, "",
                                         documentPath.c_str(), content.raw(),
                                         "lastMissedAlarm")) {
      Serial.println("[Firebase] İlaç kaçırıldı (lastMissedAlarm) bildirildi.");
    }
  }
}

// Alarm durdur
void stopAlarm() {
  alarmActive = false;
  noTone(BUZZER_PIN);
  
  // İlaç alındı efekti: İlgili LED yeşile döner, 1 sn sonra söner
  if (alarmLedIndex >= 0 && alarmLedIndex < NUM_LEDS) {
    strip.setPixelColor(alarmLedIndex, strip.Color(0, 255, 0)); // Yeşil = Alındı
    strip.show();
    delay(1000);
  }
  strip.clear();
  strip.show();
  alarmLedIndex = -1;
  
  Serial.println("[ALARM] Alarm durduruldu.");
  
  // Bilekliğin de susması için DUR sinyali gönder (2 kez — güvenilirlik)
  sendESPNowStopSignal();
  delay(50);
  sendESPNowStopSignal();
}

// ESP-NOW üzerinden bilekliğe "DUR" sinyali gönder
void sendESPNowStopSignal() {
  if (!espnowReady) return;
  
  espnow_message_t msg = {};
  strncpy(msg.deviceId, "esp32_medicine_box_01", sizeof(msg.deviceId) - 1);
  strncpy(msg.command, "DUR", sizeof(msg.command) - 1);
  msg.timestamp = millis();
  
