yugobalkan-droid/saglikbileklik/hardware/esp32/esp32_medicine_box/esp32_medicine_box.ino
  esp_now_send(broadcastAddress, (uint8_t*)&msg, sizeof(msg));
  Serial.println("[ESP-NOW] 📡 Bilekliğe DUR sinyali gönderildi.");
}

// ESP-NOW üzerinden bilekliğe "İlaç zamanı!" sinyali gönder
void sendESPNowSignal() {
  if (!espnowReady) {
    Serial.println("[ESP-NOW] ❌ ESP-NOW hazır değil!");
    return;
  }
  
  espnow_message_t msg = {};
  strncpy(msg.deviceId, "esp32_medicine_box_01", sizeof(msg.deviceId) - 1);
  strncpy(msg.command, "ILAC", sizeof(msg.command) - 1);
  msg.timestamp = millis();
  
  esp_err_t result = esp_now_send(broadcastAddress, (uint8_t*)&msg, sizeof(msg));
  if (result == ESP_OK) {
    Serial.println("[ESP-NOW] 📡 Bilekliğe sinyal gönderildi.");
  } else {
    Serial.printf("[ESP-NOW] ❌ Sinyal gönderilemedi! Hata: %d\n", result);
  }
}

// Firebase'e ilaç alındı bilgisini kaydet
void confirmMedicineTaken() {
  if (Firebase.ready()) {
    FirebaseJson content;
    content.set("fields/lastTaken/stringValue", getTimestamp());
    content.set("fields/status/stringValue", "taken");

    String documentPath = "devices/" + deviceId;
    if (Firebase.Firestore.patchDocument(&fbdo, PROJECT_ID, "",
                                         documentPath.c_str(), content.raw(),
                                         "lastTaken,status")) {
      Serial.println("[Firebase] İlaç alındı kaydedildi.");
    } else {
      Serial.println("[Firebase] Kayıt hatası: " + fbdo.errorReason());
    }
  }
}

// Firebase'e cihaz durumunu bildir
void updateDeviceStatus(String status) {
  if (!Firebase.ready())
    return;

  FirebaseJson content;
  content.set("fields/status/stringValue", status);
  content.set("fields/type/stringValue", "box");
  content.set("fields/batteryLevel/integerValue", 100);
  content.set("fields/signalStrength/stringValue", "strong");
  content.set("fields/radioModule/stringValue", "ESP-NOW");
  content.set(
      "fields/pins/stringValue",
      "NeoPixel:4(21LED) | SPK:46 | BTN:36 | Radio:ESP-NOW");

  String documentPath = "devices/" + deviceId;
  if (Firebase.Firestore.patchDocument(
          &fbdo, PROJECT_ID, "", documentPath.c_str(), content.raw(),
          "status,type,batteryLevel,signalStrength,radioModule,pins")) {
    Serial.println("[Firebase] Cihaz durumu güncellendi: " + status);
  } else {
    Serial.println("[Firebase] Güncelleme hatası: " + fbdo.errorReason());
  }
}

// Başlangıç testi: Gökkuşağı dalgası + kısa bip
void startupSequence() {
  Serial.println("[TEST] Donanım testi (21 LED Gökkuşağı)...");
  
  // Gökkuşağı dalgası: LED'ler sırayla farklı renklerde yanar
  for (int j = 0; j < 2; j++) {
    for (int i = 0; i < NUM_LEDS; i++) {
      int hue = (i * 65536 / NUM_LEDS);
      strip.clear();
      strip.setPixelColor(i, strip.gamma32(strip.ColorHSV(hue)));
      strip.show();
      tone(BUZZER_PIN, 1000 + (i * 100), 30);
      delay(60);
    }
  }
  
  // Tüm LED'leri öğün renklerinde 1 sn göster
  for (int i = 0; i < 7; i++) {
    strip.setPixelColor(i, periodColors[0]);      // Sabah yeşil
    strip.setPixelColor(i + 7, periodColors[1]);  // Öğle mavi
    strip.setPixelColor(i + 14, periodColors[2]); // Akşam mor
  }
  strip.show();
  tone(BUZZER_PIN, 2000, 200);
  delay(1000);
  
  strip.clear();
  strip.show();
  noTone(BUZZER_PIN);
  Serial.println("[TEST] Tamamlandı.");
}

// Basit timestamp (Firebase için)
String getTimestamp() {
  time_t now = time(nullptr);
  return String(now);
}
